[
  {
    "model": "catalog.category",
    "pk": 24,
    "fields": {
      "name": "Смартфоны и гаджеты",
      "description": "Мобильные телефоны, планшеты"
    }
  },
  {
    "model": "catalog.category",
    "pk": 25,
    "fields": {
      "name": "Ноутбуки и компьютеры",
      "description": "Стационарные и мобильные ПК"
    }
  },
  {
    "model": "catalog.category",
    "pk": 26,
    "fields": {
      "name": "Телевизоры и цифровое ТВ",
      "description": "Телевизоры, приставки, спутниковые тарелки"
    }
  },
  {
    "model": "catalog.category",
    "pk": 27,
    "fields": {
      "name": "Аудиотехника",
      "description": "Портативные колонки, наушники, саундбары"
    }
  },
  {
    "model": "catalog.product",
    "pk": 10,
    "fields": {
      "name": "Смартфон Samsung Galaxy Z Fold5 256Gb Phantom Black (SM-F946B)",
      "description": "Складной смартфон Samsung Galaxy Z Fold5 Icy Blue (SM-F946B) оснащен 7,6-дюймовым экраном разрешением 2176x1812 пикселей, обладающим пиковой яркостью 1750 нит, что позволит смотреть кино или играть даже под солнечными лучами — изображение не поблекнет. Внешний AMOLED-экран обладает диагональю 6,2 дюйма и разрешением 2316x904 пикселей, он отображает множество актуальной информации и предоставляет к ней быстрый доступ. Оба экрана защищены прочным стеклом Corning Gorilla Glass Victus 2. Восьмиядерный процессор Qualcomm Snapdragon 8 Gen 2 и 12 Гб оперативной памяти обеспечивают высокую производительность, которая позволит играть в современные игры без малейших подвисаний и работать одновременно в трех приложениях. Панель управления поддерживает до 12 приложений. Перо S Pen упростит управление и позволит быстро перемещать элементы, рисовать, делать заметки, словно обычной ручкой.  Объем встроенной памяти для установки приложений и хранения личных данных — 256 Гб. Беспроводные технологии представлены встроенными модулями Wi-Fi 802.11 a/b/g/n/ac/ax, Bluetooth 5.0, NFC. Основная камера тройная: 50 Мп (широкоугольная), 12 Мп (ультраширокоугольная) и 10 Мп (телеобъектив), максимальное разрешение видеосъемки — 8К (7680x4320 пикселей). Даже в сложных условиях получится качественный результат — доступна оптическая и цифровая стабилизация. Приблизить объект позволит зум 10х. За селфи и общение по видеосвязи отвечают фронтальная камера на 10 Мп и камера на 4 Мп, врезанная в экран. Сканер отпечатка пальца встроен в боковую панель. Автономная работа обеспечивает аккумулятором емкостью 4400 мА*ч, он предоставляет до 73 часов прослушивания музыки и до 21 часа просмотра видео. Поддерживается проводная зарядка мощностью 25 Вт, беспроводная — 15 Вт и обратная беспроводная — 4,5 Вт. Размеры в сложенном виде: 154,9x67,1x13,4 мм, в открытом виде: 154,9x129,9x6,1 мм. Вес смартфона — 253 г.",
      "image": "catalog/galaxy_fold.jpeg",
      "category": 24,
      "price": 189999,
      "date_created": "2023-09-19T21:30:22Z",
      "date_updated": "2023-09-19T21:30:22Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 11,
    "fields": {
      "name": "Ноутбук игровой MSI Katana 17 B12VEK-482XRU",
      "description": "Игровой ноутбук MSI Katana 17 B12VEK-482XRU выполнен в пластиковом корпусе размерами 25,2х398х273 мм и весом 2,6 кг. За высокую производительность системы отвечают процессор Intel Core i7 12650H (десять Е-ядер) и контроллер GeForce RTX 4050 с видеопамятью 6 Гб. Передовая графическая архитектуре NVidia Ada Lovelace поддерживает трассировку лучей, VR, функции ИИ, обеспечивает аппаратное ускорение профессиональных приложений, расширяя возможности для творчества и гейминга. Размер оперативной DDR5 памяти составляет 16 Гб, с возможностью увеличения до 64 Гб. Емкость SSD накопителя (M.2 PCIe) — 512 Гб.  Матовый IPS LED-экран диагональю 17,3 дюйма воспроизводит изображения разрешением 1920x1080 пикселей с яркостью до 250 нит. Развертка до 144 Гц и мгновенное время отклика повышают точность действий игроков. Технология DLSS улучшает качество картинки в играх, используя глубокую нейросеть. Клавиатура с цифровым блоком, четырехзонной RGB-подсветкой, выделенными клавишами WASD и отзывчивым тачпадом обеспечивает быстрый ввод данных.",
      "image": "catalog/notebook_msi.webp",
      "category": 25,
      "price": 124999,
      "date_created": "2023-09-19T21:32:48Z",
      "date_updated": "2023-09-19T21:32:48Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 12,
    "fields": {
      "name": "Ноутбук Apple MacBook Pro 13 M2 8/10 core 16/2TB Silver",
      "description": "Ноутбук Apple MacBook Pro 13 M2 8/10 core Silver — это сочетание компактности, прочности и высокой производительности. Корпус девайса выполнен из алюминия, обладает толщиной всего 1,56 см и весом 1,4 кг. В основе — восьмиядерный процессор Apple M2 и 16 Гб оперативной памяти. Для установки программ, приложений и хранения файлов используется SSD объемом 2 Тб. Предустановлена операционная система macOS (английский язык). Эта модель оснащена 13,3-дюймовым дисплеем Retina, выполненным по технологии IPS. Разрешение — 2560x1600 пикселей, яркость — 500 кд/м². В сочетании с расширенным цветовым охватом это создает четкое, детализированное изображение с естественной цветопередачей.  Выход в интернет обеспечивает встроенный модуль Wi-Fi стандартов a/b/g/n/ac/ax, за беспроводную синхронизацию с совместимыми устройствами отвечает Bluetooth версии 5.0. Ноутбук оснащен широким набором интерфейсов: USB C, DisplayPort, DVI, Thunderbolt, Thunderbolt 2, Thunderbolt 3, выходом для наушников (3,5 мм).",
      "image": "catalog/macbook.jpeg",
      "category": 25,
      "price": 279999,
      "date_created": "2023-09-19T21:33:41Z",
      "date_updated": "2023-09-19T21:33:41Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 13,
    "fields": {
      "name": "Саундбар LG SN5R",
      "description": "Саундбар LG SN5R — это мощная (520 Вт), удобная в управления аудиосистема, которая используется в домашних кинотеатрах. Сабвуфер закрытого типа обеспечивает объемное звучание 4.1, хорошо слышимое из любой точки комнаты. «Умное» устройство автоматически анализирует поступающий контент и подстраивает звук, исходя из полученных данных.   Поддержка Bluetooth дает возможность управлять моделью дистанционно, со смартфона, что повышает удобство эксплуатации. Внешние носители подключаются через выходы HDMI, порт USB 2.0 типа А, оптический вход. Колонки можно крепить на стену. В наборе поставляются аксессуары для настенной установки. Размеры — 89х8,5х5,7 см, вес — 10,1 кг.",
      "image": "catalog/soundbar.jpg",
      "category": 27,
      "price": 28999,
      "date_created": "2023-09-19T21:34:35Z",
      "date_updated": "2023-09-19T21:34:35Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 14,
    "fields": {
      "name": "Умная колонка Sber SberBoom (SBDV-00090a)",
      "description": "Умная колонка Sber SberBoom — модель с суммарной мощностью акустической системы 40 Вт. Устройство оснащено встроенным микрофоном. Поддерживает голосовой помощник «Сбер Салют» для управления воспроизведением треков. Подключение к сторонним устройствам (например, смартфону или планшету) возможно посредством Bluetooth версии 5.0.  Предусмотрен встроенный модуль Wi-Fi, что позволяет пользоваться онлайн-сервисами. Пластиковый корпус дополнен эффектной подсветкой, создающей настроение. В комплект входят кабель USB Type-C и блок питания. Размеры колонки составляют 20х14,5х14,5 см, вес — 1300 г.",
      "image": "catalog/sberboom.png",
      "category": 27,
      "price": 8999,
      "date_created": "2023-09-19T21:35:30Z",
      "date_updated": "2023-09-19T21:35:30Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 15,
    "fields": {
      "name": "Телевизор LG 75UR91006LA",
      "description": "Телевизор LG 75UR91006LA оснащен операционной системой WebOS и акустикой AI Sound Pro, включающей два динамика. Модель обладает экраном диагональю 75\" (189 см). Разрешение — 3840x2160 пикселей. Устройство поддерживает технологии цифрового шумоподавления и HDR, обеспечивая детализацию изображения. Пульт ДУ, смартфон и голосовые команды помогают управлять настройками — корректировать громкость и переключать каналы, определять параметры таймера, активировать функцию защиты от детей.  Приставка, ноутбук, домашний кинотеатр или жесткий диск подсоединяются при помощи интерфейсов HDMI, USB. Для сопряжения с интернетом применяются модуль Wi-Fi или разъем LAN. Максимальная мощность составляет 230 Вт. Кронштейн с креплением типа Vesa 400х300 и подставка позволяют разместить телевизор на стене или тумбе. Цвет — «синяя сажа». Размеры — 99,4х167,7х37 см. Вес — 33,3 кг",
      "image": "catalog/tv_lg.jpeg",
      "category": 26,
      "price": 144999,
      "date_created": "2023-09-19T21:36:22Z",
      "date_updated": "2023-09-19T21:36:22Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 16,
    "fields": {
      "name": "Телевизор Grundig 55 GOB 9290",
      "description": "Телевизор Grundig 55 GOB 9290 — модель с 55-дюймовым экраном разрешением Ultra HD (3840х2160 пикселей) и поддержкой современных технологий, работающих на повышение качества изображения. Wide Color Gamut и HDR10+ усиливают глубину и насыщенность цветов, делают их более естественными, Dolby Vision обрабатывает кадры для индивидуальной подборки параметров картинки, MEMC способствует плавной передаче динамичных сцен. Частота обновления экрана — 100 Гц. Акустическая система с поддержкой Dolby Atmos и Dolby Digital состоит из двух динамиков мощностью по 10 Вт и 15-ваттного сабвуфера.  Телевизор работает на операционной системе Android 11.0, объем оперативной памяти — 2 Гб. Выход в Сеть производится по Wi-Fi или проводным способом — через разъем LAN. 16 Гб встроенной памяти дадут возможность установить различные приложения и получить доступ к стриминговым сервисам и онлайн-кинотеатрам. Модуль Bluetooth обеспечивает синхронизацию со смартфонами и другими совместимыми устройствами.",
      "image": "catalog/grundig.jpeg",
      "category": 26,
      "price": 159999,
      "date_created": "2023-09-19T21:37:19Z",
      "date_updated": "2023-09-19T21:37:19Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 17,
    "fields": {
      "name": "Смартфон Apple iPhone 15 Pro 128GB Black Titanium",
      "description": "Смартфон Apple iPhone 15 Pro Black Titanium получил дисплей диагональю 6,1 дюйма, выполненный по технологии Super Retina XDR. Разрешение — 2556x1179 пикселей, яркость достигает 2000 кд/м², контрастность составляет 2000000:1 — изображение четкое, детализированное и насыщенное. Частота обновления 120 Гц обеспечивает плавность отображения любого динамичного контента. Экран защищает прочное стекло Ceramic Shield.  В основе — шестиядерный процессор A17 Pro. Объем встроенной памяти для хранения данных — 128 Гб. Смартфон работает с nano-SIM и e-SIM в сетях вплоть до 5G. Предусмотрена поддержка Wi-Fi для выхода в Сеть там, где есть точка доступа, Bluetooth версии 5.3 для связи с совместимыми устройствами и NFC для бесконтактной оплаты и других задач.  Основная камера тройная: 48/12/12 Мп. Она способна снимать в разрешении до 4К (3840x2160 пикселей). Оптический зум на увеличение и на уменьшение, цифровая и оптическая стабилизация и вспышка помогут получить отличные результаты в любых условиях. Фокус при съемке портретов",
      "image": "catalog/iphone.jpeg",
      "category": 24,
      "price": 159999,
      "date_created": "2023-09-19T21:38:47Z",
      "date_updated": "2023-09-19T21:38:47Z"
    }
  },
  {
    "model": "catalog.product",
    "pk": 25,
    "fields": {
      "name": "Ноутбук для бизнеса Lenovo ThinkPad X1 Extreme Gen 5",
      "description": "Ноутбук для бизнеса Lenovo ThinkPad X1 Extreme Gen 5 функционирует на основе 14-ядерного процессора Intel Core i7 12800H 2.4 ГГц, который обеспечивает высокую работоспособность и многозадачность. Контроллер GeForce RTX 3070 Ti 8GB осуществляет быструю обработку графической составляющей цифровых данных. Объем жесткого диска составляет 2 ТБ, объем оперативной памяти достигает 64 ГБ. Эти характеристики позволяют наполнить устройство необходимым количеством приложений и цифровых информационных файлов. Подачу питания осуществляет штатный аккумулятор, емкости которого достаточно для 11 ч рабочего процесса.  Ноутбук оборудован матовым экраном диагональю 16\" с технологией IPS и частотой обновления 60 Гц, который отличается высокой цветопередачей, яркостью и контрастностью, широкими углами обзора. Штатная клавиатура дополнена подсветкой клавиш, что позволяет использовать ее даже в условиях слабого освещения. Камера высокого разрешения осуществляет запись видео и видеозвонки с высоким качеством картинки. За беспроводную передачу данных отвечают модули Wi-Fi и Bluetooth. Для безопасного входа в устройство предусмотрено наличие датчика отпечатков пальцев. Конструкция модели включает в себя интерфейсы HDMI, USB 3.2 тип A, USB 4 тип C, Thunderbolt 4, разъем для карты памяти формата SD и разъем для подключения наушников или микрофона 3,5 мм.",
      "image": "catalog/lenovo_wRDaBLa.png",
      "category": 25,
      "price": 449990,
      "date_created": "2023-10-13T00:00:00Z",
      "date_updated": "2023-10-13T00:00:00Z"
    }
  },
  {
    "model": "catalog.version",
    "pk": 1,
    "fields": {
      "product": 12,
      "version_number": 1,
      "version_name": "Версия 1",
      "current_version": false
    }
  },
  {
    "model": "catalog.version",
    "pk": 2,
    "fields": {
      "product": 11,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 3,
    "fields": {
      "product": 13,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 4,
    "fields": {
      "product": 17,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 5,
    "fields": {
      "product": 10,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 6,
    "fields": {
      "product": 16,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 7,
    "fields": {
      "product": 15,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 8,
    "fields": {
      "product": 14,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 9,
    "fields": {
      "product": 12,
      "version_number": 2,
      "version_name": "Версия 2.1.1",
      "current_version": true
    }
  },
  {
    "model": "catalog.version",
    "pk": 10,
    "fields": {
      "product": 25,
      "version_number": 1,
      "version_name": "Версия 1.0.0",
      "current_version": false
    }
  },
  {
    "model": "catalog.version",
    "pk": 11,
    "fields": {
      "product": 25,
      "version_number": 1,
      "version_name": "Версия 1.0.1",
      "current_version": true
    }
  }
]